nxp-mcuxpresso/mcux-soc-svd/MCXN557T/MCXN557T_cm33_core1.xml
        <register>
          <name>BAUD</name>
          <description>Baud Rate</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SBR</name>
              <description>Baud Rate Modulo Divisor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SBNS</name>
              <description>Stop Bit Number Select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>One stop bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Two stop bits</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXEDGIE</name>
              <description>RX Input Active Edge Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBKDIE</name>
              <description>LIN Break Detect Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESYNCDIS</name>
              <description>Resynchronization Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESYNC</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_RESYNC</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOTHEDGE</name>
              <description>Both Edge Sampling</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Rising edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Both rising and falling edges</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MATCFG</name>
              <description>Match Configuration</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_MATCH</name>
                  <description>Address match wake-up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_MATCH</name>
                  <description>Idle match wake-up</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONOFF_MATCH</name>
                  <description>Match on and match off</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWU_MATCH</name>
                  <description>Enables RWU on data match and match on or off for the transmitter CTS input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIDMAE</name>
              <description>Receiver Idle DMA Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDMAE</name>
              <description>Receiver Full DMA Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDMAE</name>
              <description>Transmitter DMA Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSR</name>
              <description>Oversampling Ratio</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Results in an OSR of 16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_4</name>
                  <description>Results in an OSR of 4 (requires BAUD[BOTHEDGE] to be 1)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_5</name>
                  <description>Results in an OSR of 5 (requires BAUD[BOTHEDGE] to be 1)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_6</name>
                  <description>Results in an OSR of 6 (requires BAUD[BOTHEDGE] to be 1)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_7</name>
                  <description>Results in an OSR of 7 (requires BAUD[BOTHEDGE] to be 1)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_8</name>
                  <description>Results in an OSR of 8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_9</name>
                  <description>Results in an OSR of 9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_10</name>
                  <description>Results in an OSR of 10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_11</name>
                  <description>Results in an OSR of 11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_12</name>
                  <description>Results in an OSR of 12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_13</name>
                  <description>Results in an OSR of 13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_14</name>
                  <description>Results in an OSR of 14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_15</name>
                  <description>Results in an OSR of 15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_16</name>
                  <description>Results in an OSR of 16</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_17</name>
                  <description>Results in an OSR of 17</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_18</name>
                  <description>Results in an OSR of 18</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_19</name>
                  <description>Results in an OSR of 19</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_20</name>
                  <description>Results in an OSR of 20</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_21</name>
                  <description>Results in an OSR of 21</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_22</name>
                  <description>Results in an OSR of 22</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_23</name>
                  <description>Results in an OSR of 23</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_24</name>
                  <description>Results in an OSR of 24</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_25</name>
                  <description>Results in an OSR of 25</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_26</name>
                  <description>Results in an OSR of 26</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_27</name>
                  <description>Results in an OSR of 27</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_28</name>
                  <description>Results in an OSR of 28</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_29</name>
                  <description>Results in an OSR of 29</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_30</name>
                  <description>Results in an OSR of 30</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_31</name>
                  <description>Results in an OSR of 31</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_32</name>
                  <description>Results in an OSR of 32</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M10</name>
              <description>10-Bit Mode Select</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Receiver and transmitter use 7-bit to 9-bit data characters</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Receiver and transmitter use 10-bit data characters</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAEN2</name>
              <description>Match Address Mode Enable 2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAEN1</name>
              <description>Match Address Mode Enable 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
