nxp-mcuxpresso/mcux-soc-svd/MCXN557T/MCXN557T_cm33_core1.xml
        <register>
          <name>FIFO_CTRL</name>
          <description>MICFIL FIFO Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFOWMK</name>
              <description>FIFO Watermark Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_STAT</name>
          <description>MICFIL FIFO Status</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>FIFOOVF0</name>
              <description>FIFO Overflow Exception Flag for Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF1</name>
              <description>FIFO Overflow Exception Flag for Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF2</name>
              <description>FIFO Overflow Exception Flag for Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF3</name>
              <description>FIFO Overflow Exception Flag for Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND0</name>
              <description>FIFO Underflow Exception Flag for Channel 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND1</name>
              <description>FIFO Underflow Exception Flag for Channel 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND2</name>
              <description>FIFO Underflow Exception Flag for Channel 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND3</name>
              <description>FIFO Underflow Exception Flag for Channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by FIFO underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DATACH[%s]</name>
          <description>MICFIL Output Result</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Channel n Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_CTRL</name>
          <description>MICFIL DC Remover Control</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCCONFIG0</name>
              <description>Channel 0 DC Remover Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG1</name>
              <description>Channel 1 DC Remover Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG2</name>
              <description>Channel 2 DC Remover Configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG3</name>
              <description>Channel 3 DC Remover Configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_OUT_CTRL</name>
          <description>MICFIL Output DC Remover Control</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCCONFIG0</name>
              <description>Channel 0 DC Remover Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG1</name>
              <description>Channel 1 DC Remover Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG2</name>
              <description>Channel 2 DC Remover Configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG3</name>
              <description>Channel 3 DC Remover Configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RANGE_CTRL</name>
          <description>MICFIL Range Control</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGEADJ0</name>
              <description>Channel 0 Range Adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ1</name>
              <description>Channel 1 Range Adjustment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ2</name>
              <description>Channel 2 Range Adjustment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ3</name>
              <description>Channel 3 Range Adjustment</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
